src/cf/InformationRegisters/уатНормыРасходаГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатНормыРасходаГСМ</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЛинейнаяНорма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаЕздку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаЗапуск</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаИзменениеСобственногоВеса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаОперацию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаОтопитель</Name>
					<Comment>Норма на отопитель, кондиционер, климат-контроль</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаПростойСВклДвигателем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаПростойСВклДвигателемЛитры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаПростойСВклДвигателемПроцентомОтБазовой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота4</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота5</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота6</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота7</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота8</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота9</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота10</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу7</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу8</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу9</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу10</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаТранспортнуюРаботу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаСпециальнаяНаМоточас</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СезоннаяНадбавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НадбавкаНаКондиционер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьПростоиДляРасчетаНормыМоточасов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АлгоритмРасчета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаБулиты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаПредПЖД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГСМ</Name>
					<Comment>ГСМ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МодельТС</Name>
					<Comment>Модель ТС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РаботаНаДвухВидахТопливаОдновременно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатНормыРасходаГСМ/Forms/ШаблоныФормул/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НаличиеСпидометра = Параметры.НаличиеСпидометра;
	
	Если НаличиеСпидометра Тогда
		ЛинейнаяНормаСтрока = "На пробег (линейная)";
	Иначе
		ЛинейнаяНормаСтрока = "Спец. на моточас";
	КонецЕсли;
	
	ШаблоныФормул.Добавить(ЛинейнаяНормаСтрока + " + На простой с вкл.двиг. + На ездки + На запуск", "Легковые автомобили");
	ШаблоныФормул.Добавить(ЛинейнаяНормаСтрока + " + На простой с вкл.двиг. + На отопитель + На ездки + На запуск", "Автобусы");
	ШаблоныФормул.Добавить(ЛинейнаяНормаСтрока + " + На транспортную работу + На изменение веса + На отопитель + На простой с вкл.двиг. + На ездки + На запуск + На операции", "Грузовые автомобили");
	ШаблоныФормул.Добавить(ЛинейнаяНормаСтрока + " + На транспортную работу + На отопитель + На простой с вкл.двиг. + На ездки + На запуск + На операции", "Самосвалы");
	ШаблоныФормул.Добавить(ЛинейнаяНормаСтрока + " + На транспортную работу + На изменение веса + На отопитель + На простой с вкл.двиг. + На ездки + На запуск + На операции + На спец.работу 1", "Специальные автомобили");
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура ШаблоныФормулВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьШаблон();
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныФормулПриАктивизацииСтроки(Элемент)
	ТекСтрока = Элементы.ШаблоныФормул.ТекущиеДанные;
	Если ТекСтрока.Представление = "Легковые автомобили" Тогда
		Описание = ПолучитьОписаниеИзМакета("ОписаниеШаблонЛегковые");
	ИначеЕсли ТекСтрока.Представление = "Автобусы" Тогда
		Описание = ПолучитьОписаниеИзМакета("ОписаниеШаблонАвтобусы");
	ИначеЕсли ТекСтрока.Представление = "Грузовые автомобили" Тогда
		Описание = ПолучитьОписаниеИзМакета("ОписаниеШаблонГрузовые");
	ИначеЕсли ТекСтрока.Представление = "Самосвалы" Тогда
		Описание = ПолучитьОписаниеИзМакета("ОписаниеШаблонСамосвалы");
	Иначе
		Описание = ПолучитьОписаниеИзМакета("ОписаниеШаблонСпецавтомобили");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	ВыбратьШаблон();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьОписаниеИзМакета(ИмяМакета)
	Возврат РегистрыСведений.уатНормыРасходаГСМ.ПолучитьМакет(ИмяМакета).ПолучитьТекст();
КонецФункции

&НаКлиенте
Процедура ВыбратьШаблон()
	ТекСтрока = Элементы.ШаблоныФормул.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Рез = Неопределено;
	Иначе
		Рез = Новый Структура;
		Рез.Вставить("ОбщаяФормула", ТекСтрока.Значение);
		Если НаличиеСпидометра Тогда
			Рез.Вставить("ЛинейнаяНорма", "0.01*[Hs]*[S]*[HL]");
			Рез.Вставить("ЛинейнаяНормаКоэффициент", "[Kсн]+[Kтм]+[Kтс]+[Kур]+[Kнк]");
			Рез.Вставить("ЛинейнаяНормаИспользование", Истина);
		Иначе
			Рез.Вставить("НормаСпециальнаяНаМоточас", "[Ht]*[T]");
			Рез.Вставить("НормаСпециальнаяНаМоточасКоэффициент", "[Kсн]+[Kтм]+[Kтс]+[Kур]+[Kнк]");
			Рез.Вставить("НормаСпециальнаяНаМоточасИспользование", Истина);
		КонецЕсли;
		Рез.Вставить("НормаНаПростойСВклДвигателем", "[Hdt]*[DT]");
		Рез.Вставить("НормаНаПростойСВклДвигателемКоэффициент", "[Kтс]");
		Рез.Вставить("НормаНаПростойСВклДвигателемИспользование", Истина);
		Рез.Вставить("НормаНаЕздку", "[Hhl]*[HL]");
		Рез.Вставить("НормаНаЕздкуКоэффициент", "");
		Рез.Вставить("НормаНаЕздкуИспользование", Истина);
		Рез.Вставить("НормаНаЗапуск", "[Hst]*[ST]");
		Рез.Вставить("НормаНаЗапускКоэффициент", "[Kсн]+[Kтм]");
		Рез.Вставить("НормаНаЗапускИспользование", Истина);
				
		Если ТекСтрока.Представление = "Автобусы" Тогда
			Рез.Вставить("НормаНаОтопитель", "[Hht]*[Tht]");
			Рез.Вставить("НормаНаОтопительКоэффициент", "");
			Рез.Вставить("НормаНаОтопительИспользование", Истина);
		ИначеЕсли ТекСтрока.Представление = "Грузовые автомобили" Тогда
			Рез.Вставить("НормаНаОперацию", "[Hop]*[OP]");
			Рез.Вставить("НормаНаОперациюКоэффициент", "[Kсн]+[Kтм]");
			Рез.Вставить("НормаНаОперациюИспользование", Истина);
			Рез.Вставить("НормаНаОтопитель", "[Hht]*[Tht]");
			Рез.Вставить("НормаНаОтопительКоэффициент", "");
			Рез.Вставить("НормаНаОтопительИспользование", Истина);
			Рез.Вставить("НормаНаИзменениеСобственногоВеса", "0.01*[Hg]*[S]*[Gив]*[HL]");
			Рез.Вставить("НормаНаИзменениеСобственногоВесаКоэффициент", "[Kсн]+[Kтм]+[Kтс]+[Kур]");
			Рез.Вставить("НормаНаИзменениеСобственногоВесаИспользование", Истина);
			Рез.Вставить("НормаНаТранспортнуюРаботу", "0.01*[Hw]*[Sгр]*[Gгр]*[HL]");
			Рез.Вставить("НормаНаТранспортнуюРаботуКоэффициент", "[Kсн]+[Kтм]+[Kтс]+[Kур]");
			Рез.Вставить("НормаНаТранспортнуюРаботуИспользование", Истина);
		ИначеЕсли ТекСтрока.Представление = "Самосвалы" Тогда
			Рез.Вставить("НормаНаОперацию", "[Hop]*[OP]");
			Рез.Вставить("НормаНаОперациюКоэффициент", "[Kсн]+[Kтм]");
			Рез.Вставить("НормаНаОперациюИспользование", Истина);
			Рез.Вставить("НормаНаОтопитель", "[Hht]*[Tht]");
			Рез.Вставить("НормаНаОтопительКоэффициент", "");
			Рез.Вставить("НормаНаОтопительИспользование", Истина);
			Рез.Вставить("НормаНаТранспортнуюРаботу", "0.01*[Hw]*[S]*[GP]*[Q]*[HL]");
			Рез.Вставить("НормаНаТранспортнуюРаботуКоэффициент", "[Kсн]+[Kтм]+[Kтс]+[Kур]");
			Рез.Вставить("НормаНаТранспортнуюРаботуИспользование", Истина);
		ИначеЕсли ТекСтрока.Представление = "Специальные автомобили" Тогда
			Рез.Вставить("НормаНаОперацию", "[Hop]*[OP]");
			Рез.Вставить("НормаНаОперациюКоэффициент", "[Kсн]+[Kтм]");
			Рез.Вставить("НормаНаОперациюИспользование", Истина);
			Рез.Вставить("НормаНаОтопитель", "[Hht]*[Tht]");
			Рез.Вставить("НормаНаОтопительКоэффициент", "");
			Рез.Вставить("НормаНаОтопительИспользование", Истина);
			Рез.Вставить("НормаНаИзменениеСобственногоВеса", "0.01*[Hg]*[S]*[Gив]*[HL]");
			Рез.Вставить("НормаНаИзменениеСобственногоВесаКоэффициент", "[Kсн]+[Kтм]+[Kтс]+[Kур]");
			Рез.Вставить("НормаНаИзменениеСобственногоВесаИспользование", Истина);
			Рез.Вставить("НормаНаТранспортнуюРаботу", "0.01*[Hw]*[Sгр]*[Gгр]*[HL]");
			Рез.Вставить("НормаНаТранспортнуюРаботуКоэффициент", "[Kсн]+[Kтм]+[Kтс]+[Kур]");
			Рез.Вставить("НормаНаТранспортнуюРаботуИспользование", Истина);
			Рез.Вставить("НормаНаСпециальнуюРаботу1", "0.01*[Hсп1]*[Сп1]");
			Рез.Вставить("НормаНаСпециальнуюРаботу1Коэффициент", "[Kсн]+[Kтм]+[Kтс]+[Kур]");
			Рез.Вставить("НормаНаСпециальнуюРаботу1Использование", Истина);
		КонецЕсли;
	КонецЕсли;
		
	Закрыть(Рез);
КонецПроцедуры

#КонецОбласти
